---
kind: method
id: M:Autodesk.Revit.DB.KeyBasedTreeEntriesLoadResults.#ctor
source: html/45baf26b-48d9-c749-8080-0412ca91ccf2.htm
---
# Autodesk.Revit.DB.KeyBasedTreeEntriesLoadResults.#ctor Method

Creates an empty KeyBasedTreeEntriesLoadResults.

## Syntax (C#)
```csharp
public KeyBasedTreeEntriesLoadResults()
```